title: Detection of Suspicious PowerShell Usage by Standard Accounts
id: f0d7b391-50f2-4bcf-b88d-powershellsuspicious
status: experimental
logsource:
  product: windows
  service: security
  eventid: 4688
selection:
  New_Process_Name:
    - '*powershell.exe'
  Process_Command_Line:
    - '*Bypass*'
  Account_Name:
    - '!frank'
    - '!olivia'
    - '!alice'
    - '!yara'
    - '!david'
    - '!katherine'
    - '!uma'
    - '!SRV-PRD-DC$'
    - '!SRV-PRD-WEB$'
    - '!SRV-PRD-DB$'
    - '!SRV-PRD-SHARE$'

fields:
  - host
  - source
  - sourcetype
  - Account_Name
  - ComputerName
  - Process_Command_Line
  - timestamp

description: >
  This rule detects suspicious PowerShell commands executed by standard accounts using the "Bypass" flag, which could indicate an attempt to bypass security controls and escalate privileges.

detection:
  selection:
    EventID: 4688
    New_Process_Name: '*powershell.exe'
    Process_Command_Line: '*Bypass*'
    Account_Name:
      - '!frank'
      - '!olivia'
      - '!alice'
      - '!yara'
      - '!david'
      - '!katherine'
      - '!uma'
      - '!SRV-PRD-DC$'
      - '!SRV-PRD-WEB$'
      - '!SRV-PRD-DB$'
      - '!SRV-PRD-SHARE$'
  condition: selection

tags:
  - attack.execution
  - attack.t1059.001
  - impact.high

librairie_de_pivots:
  - Hostname of the affected machine
  - Account executing PowerShell
  - Command used in PowerShell session

fiche_reflexe_remediation:
  - Restrict the use of PowerShell to authorized accounts only.
  - Monitor for the use of "Bypass" and other suspicious flags in PowerShell commands.
  - Investigate accounts executing suspicious PowerShell commands and take appropriate actions to prevent misuse.

ttl: 3600
